In [1]:
import pandas as pd

# 数据去重操作

## Series 的去重操作

In [2]:
# 创建一个 Series 数据
new_series = pd.Series([1, 3, 2, 4, 3, 5, 1, 8, 9, 7, 8])
new_series

0     1
1     3
2     2
3     4
4     3
5     5
6     1
7     8
8     9
9     7
10    8
dtype: int64

**示例1：删除 Series 数据中重复的元素**

In [4]:
# 使用 drop_duplicates 删除 Series 中重复的元素
new_series.drop_duplicates()

0    1
1    3
2    2
3    4
5    5
7    8
8    9
9    7
dtype: int64

In [5]:
# 使用 unique 对 Series 中的数据去重
new_series.unique()

array([1, 3, 2, 4, 5, 8, 9, 7])

## Dataframe 的去重操作

In [3]:
scientists = pd.read_csv('./data/scientists_duplicates.csv')
scientists

                   Name        Born        Died   Age          Occupation
0     Rosaline Franklin   1920/7/25   1958/4/16  37.0             Chemist
1        William Gosset  1876-06-13  1937/10/16  61.0        Statistician
2  Florence Nightingale  1820-05-12   1910/8/13  90.0               Nurse
3           Marie Curie  1867-11-07    1934/7/4  66.0             Chemist
4         Rachel Carson   1907/5/27   1964/4/14  56.0           Biologist
5             John Snow  1813-03-15  1858-06-16  45.0           Physician
6           Alan Turing         NaN    1954/6/7  41.0  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician
8  Florence Nightingale  1820-05-12   1910/8/13  90.0               Nurse
9             John Snow  1813-03-15  1858-06-16   NaN           Physician

**示例1：删除 DataFrame 数据中完全重复的行**

In [6]:
# 注意：此处是返回了一个新的 DataFrame，原 DataFrame 的数据并没有改变
scientists.drop_duplicates()

                   Name        Born        Died   Age          Occupation
0     Rosaline Franklin   1920/7/25   1958/4/16  37.0             Chemist
1        William Gosset  1876-06-13  1937/10/16  61.0        Statistician
2  Florence Nightingale  1820-05-12   1910/8/13  90.0               Nurse
3           Marie Curie  1867-11-07    1934/7/4  66.0             Chemist
4         Rachel Carson   1907/5/27   1964/4/14  56.0           Biologist
5             John Snow  1813-03-15  1858-06-16  45.0           Physician
6           Alan Turing         NaN    1954/6/7  41.0  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician
9             John Snow  1813-03-15  1858-06-16   NaN           Physician

**示例2：删除 DataFrame 数据中 Name、Born、Died 三列相同的行**

In [7]:
# 删除指定列值相同的行
scientists.drop_duplicates(subset=['Name', 'Born', 'Died'])

                   Name        Born        Died   Age          Occupation
0     Rosaline Franklin   1920/7/25   1958/4/16  37.0             Chemist
1        William Gosset  1876-06-13  1937/10/16  61.0        Statistician
2  Florence Nightingale  1820-05-12   1910/8/13  90.0               Nurse
3           Marie Curie  1867-11-07    1934/7/4  66.0             Chemist
4         Rachel Carson   1907/5/27   1964/4/14  56.0           Biologist
5             John Snow  1813-03-15  1858-06-16  45.0           Physician
6           Alan Turing         NaN    1954/6/7  41.0  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician